Revit 2027 API
AnalysisDisplayLegendSettings.ShowUnits Property
 If true, units are shown in the legend.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowUnits { get; set; }
Public Property ShowUnits As Boolean
	Get
	Set
public:
property bool ShowUnits {
	bool get ();
	void set (bool value);
}
member ShowUnits : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace